Revit 2027 API
ViewDisplaySketchyLines.Extension Property
 The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Extension { get; set; }
Public Property Extension As Integer
	Get
	Set
public:
property int Extension {
	int get ();
	void set (int value);
}
member Extension : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The extension value is not valid. The valid range is 0 to 10.
See Also
Reference
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace